[
    {
        "id": "2eac2186",
        "name": "ashes",
        "joke": "When the window fell into the incinerator, it was a pane in the ash to retrieve."
    },
    {
        "id": "c526955f",
        "name": "pirate's favorite letter",
        "joke": "What's a pirate's favorite letter? It be the Sea"
    },
    {
        "id": "4fd6156b",
        "name": "counting cows",
        "joke": "How do you count cows? A 'Cow'culator"
    },
    {
        "id": "651bc854",
        "name": "He's Alright",
        "joke": "Did you hear about the guy whose whole left side was cut off? He's all right now."
    },
    {
        "id": "22dea85e",
        "name": "Bakery Fire",
        "joke": "My friend's bakery burned down last night. Now his business is toast."
    },
    {
        "id": "74bddcfd",
        "name": "Nut Assault",
        "joke": "Two peanuts were walking down the street. One was a salted."
    },
    {
        "id": "0e649c7e",
        "name": "Wonderwall",
        "joke": "My son asked me to stop singing Oasis songs in public. I said maybe."
    },
    {
        "id": "fd34db50",
        "name": "Banking",
        "joke": "I used to be a banker but I lost interest"
    },
    {
        "id": "0009b5e4",
        "name": "Golfer Pants",
        "joke": "Why did the golfer bring two pairs of pants? In case he got a hole-in-one."
    },
    {
        "id": "90482c63",
        "name": "Lieutenant Dan",
        "joke": "To the man in the wheelchair that stole my camouflage jacket; You can hide, but you can't run."
    },
    {
        "id": "81a2d43c",
        "name": "Flamingo",
        "joke": "When my wife told me to stop impersonating a flamingo, I had to put my foot down."
    },
    {
        "id": "3a6276ef",
        "name": "My Day",
        "joke": "The rotation of earth really makes my day."
    },
    {
        "id": "fa4617bb",
        "name": "Chickens can't drive",
        "joke": "Why do chicken coops only have two doors? Because if they had four, they would be chicken sedans."
    },
    {
        "id": "fa5eeda3",
        "name": "Bel Air",
        "joke": "How do you find Will Smith in the snow? You look for the fresh prints."
    },
    {
        "id": "bc3d7a48",
        "name": "No Charge",
        "joke": "A proton, an electron, & a neutron walk into a bar. The proton orders a shot, drinks it, pulls out his wallet, and pays the bartender. The electron orders a shot, drinks it, pulls out his wallet, and pays the bartender. The neutron orders a shot, drinks it, then pulls out his wallet. The bartender stops him and says, \"for you, no charge...\""
    },
    {
        "id": "ab0be3ec",
        "name": "I'm Positive",
        "joke": "Two atoms are walking down the street. One says, \"Oh no! I lost an electron!\", The other asks him, \"Are you sure?\", The first one says, \"Yeah, I'm positive\""
    },
    {
        "id": "64e2fc14",
        "name": "Sandwich",
        "joke": "A ham sandwich walks into a bar and orders a beer. The bartender looks at him and says, \"Sorry we don't serve food here.\""
    },
    {
        "id": "18c42b79",
        "name": "I Can't Hear This Joke",
        "joke": "What is Beethoven's favorite fruit? A ba-na-na-na."
    },
    {
        "id": "4fca91c6",
        "name": "Exhaust",
        "joke": "I had a dream that I was a muffler last night. I woke up exhausted."
    },
    {
        "id": "db4c6a4a",
        "name": "Watch Your Head",
        "joke": "Two guys walk into a bar, the third one ducks."
    },
    {
        "id": "03ac5ebb",
        "name": "Every 6 Months",
        "joke": "What time did the man go to the dentist? Tooth hurt-y."
    },
    {
        "id": "b6dc0870",
        "name": "Color Blind",
        "joke": "Found out I was colour blind the other day... That one came right out the purple."
    },
    {
        "id": "ab84a709",
        "name": "Thing Factory",
        "joke": "Where are average things built? In the satisfactory."
    },
    {
        "id": "051227b9",
        "name": "Thoughtful Clown",
        "joke": "Yesterday a clown held a door open for me. I thought it was a nice jester."
    },
    {
        "id": "3e1789f5",
        "name": "Frog Facts",
        "joke": "Just read a few facts about frogs. They were ribbiting."
    },
    {
        "id": "395448f6",
        "name": "Trampoline Bed",
        "joke": "I just swapped our bed for a trampoline. My wife hit the roof."
    },
    {
        "id": "7468097f",
        "name": "24 Hours",
        "joke": "Astronomers got tired of watching the moon go round the earth for 24 hours, so they decided to call it a day."
    },
    {
        "id": "47cf657b",
        "name": "Checkout Girl",
        "joke": "I asked the checkout girl for a date. She said \"They're in the fruit aisle next to the bananas.\""
    },
    {
        "id": "1552cf30",
        "name": "Well Dressed Bicycle",
        "joke": "What's the difference between a well dressed man on a a bicycle and a poorly dressed man on a tricycle? Attire!"
    },
    {
        "id": "12d42b25",
        "name": "Pirate Birthday",
        "joke": "What did the pirate say on his 80th birthday? Aye matey"
    },
    {
        "id": "f694783c",
        "name": "Italians",
        "joke": "What do you call a sketchy Italian neighbourhood? The Spaghetto."
    },
    {
        "id": "0299eb9b",
        "name": "Kleptomania",
        "joke": "I have kleptomania, but when it gets bad, I take something for it."
    },
    {
        "id": "8820ebd8",
        "name": "Doorbells",
        "joke": "Doorbells, don't knock 'em."
    },
    {
        "id": "11494f48",
        "name": "Tropical Diet",
        "joke": "My wife is on a tropical food diet, the house is full of the stuff. It's enough to make a mango crazy."
    },
    {
        "id": "8cf94093",
        "name": "Whiteboards",
        "joke": "Whiteboards are remarkable."
    },
    {
        "id": "5763188a",
        "name": "I Wish I Had Laser Hair",
        "joke": "Why do so many people with laser hair want to get it removed?"
    },
    {
        "id": "8ca7aba6",
        "name": "Terror Of The Skies",
        "joke": "What has twenty legs and flies? Ten pairs of pants."
    },
    {
        "id": "cce5cbac",
        "name": "The Incredible Mr. Dead",
        "joke": "What has twenty legs and flies? Five dead Horses."
    },
    {
        "id": "4c395572",
        "name": "Eye Love This Joke",
        "joke": "What do you call a fish with no eyes? Fsh."
    },
    {
        "id": "27d5bf38",
        "name": "I'll Never Let Go Of This Joke",
        "joke": "What do you get if you cross the Atlantic with the Titanic? About halfway."
    },
    {
        "id": "faa7e701",
        "name": "Why Don't They Just Open A Bankery",
        "joke": "Why do bakers work so hard? They knead the dough."
    },
    {
        "id": "76942e59",
        "name": "Meling",
        "joke": "What do you call a man with a rug on his head? Matt."
    },
    {
        "id": "c9aaad4d",
        "name": "The Royal Flush Of The Jungle",
        "joke": "Why shouldn't you play cards in the jungle? Too many cheetahs."
    },
    {
        "id": "0fc88703",
        "name": "Obviously",
        "joke": "What's big, red, and eats rocks? A big, red, rock-eater."
    },
    {
        "id": "7bae6c84",
        "name": "A Toast To Monkey Jokes",
        "joke": "How do you make toast in the jungle? Pop your bread under a g'rilla."
    },
    {
        "id": "06bac40c",
        "name": "These Jokes Have Sunk So Low",
        "joke": "What lies on the ocean floor and shivers? A nervous wreck."
    },
    {
        "id": "0efbad3c",
        "name": "Wanted For Eight Armed Robbery",
        "joke": "Who is the quickest draw in the ocean? Billy the Squid."
    },
    {
        "id": "3775c7e2",
        "name": "Prison Jewelry",
        "joke": "What's the difference between a jeweller and a prison warden? One sells watches, and the other watches cells."
    },
    {
        "id": "e779f305",
        "name": "My Nephew",
        "joke": "What's brown and sticky? A stick."
    },
    {
        "id": "3719ac94",
        "name": "Banana Joke For Scale",
        "joke": "Why did the banana go to the doctors'? He wasn't peeling very well."
    },
    {
        "id": "e428e874",
        "name": "Napoleonic Bad Joke",
        "joke": "Where did Napoleon keep his armies? Up his sleevies."
    },
    {
        "id": "19536c80",
        "name": "Andes Are In The Candy Aisle",
        "joke": "Where are the Andes? At the end of your armies."
    },
    {
        "id": "2a528ebe",
        "name": "Lawnmower Bird-Man",
        "joke": "What do you get when you run over a bird with your lawnmower? Shredded tweet."
    },
    {
        "id": "8cd3b5ea",
        "name": "This Piano Jokes Struck A Chord",
        "joke": "What do you get if you drop a piano down a coal shaft? A flat minor."
    },
    {
        "id": "7ff5b927",
        "name": "Burglars",
        "joke": "How does a burglar get into your house? Intruder window."
    },
    {
        "id": "3d66a4ab",
        "name": "Just The Tip Of The Worm",
        "joke": "What's worse than finding a worm in your apple? Finding half a worm."
    },
    {
        "id": "61642a2b",
        "name": "If You Count Alcoholics As Wealth",
        "joke": "What is the richest country in the world? Ireland. Its capital is always Dublin."
    },
    {
        "id": "403812cc",
        "name": "Do Androids Dream of Electric Clouds?",
        "joke": "What do you call a sheep with no legs? A cloud."
    },
    {
        "id": "0957a0bf",
        "name": "Beef Oven",
        "joke": "What was Beethoven's fifth favorite fruit? Ba-na-na-na."
    },
    {
        "id": "c185d36b",
        "name": "Your Grapes Take My Breath Away",
        "joke": "What did the green grape say to the purple grape? Breathe, you fool, breathe!"
    },
    {
        "id": "3779b0e7",
        "name": "Soul Duck",
        "joke": "How do you turn a duck into a soul singer? Put it in a microwave until its bill withers."
    },
    {
        "id": "cc112fd2",
        "name": "A Wall Of movies",
        "joke": "Last night me and my girlfriend watched three movies back to back. Luckily I was the one facing the TV."
    },
    {
        "id": "8007fbad",
        "name": "De-Grubered",
        "joke": "I've deleted the phone numbers of all the Germans I know from my mobile phone. Now it's Hans free."
    },
    {
        "id": "4970b3b4",
        "name": "You Can't Handle The Ending",
        "joke": "Why did the octopus beat the shark in a fight? Because it was well armed."
    },
    {
        "id": "ac158965",
        "name": "Color Me Concerned",
        "joke": "A red and a blue ship have just collided in the Caribbean. Apparently the survivors are marooned."
    },
    {
        "id": "b3029129",
        "name": "Swiss Cheesey",
        "joke": "What's the advantage of living in Switzerland? Well, the flag is a big plus."
    },
    {
        "id": "377d4fb2",
        "name": "This Joke Expired Years Ago",
        "joke": "I am terrified of elevators. I'm going to start taking steps to avoid them."
    },
    {
        "id": "5fc986ec",
        "name": "The Dream Was Deep In Soda Me",
        "joke": "I dreamed about drowning in an ocean made out of orange soda last night. It took me a while to work out it was just a Fanta sea."
    },
    {
        "id": "9d92295e",
        "name": "You Have To Be Kitten Me",
        "joke": "My cat just threw up on the carpet. I don't think it's feline well."
    },
    {
        "id": "01abc0a0",
        "name": "My Type Of Humor",
        "joke": "I went to the doctor today and he told me I had type A blood, but it was a type O."
    },
    {
        "id": "6f003dcc",
        "name": "Tasteless Joke",
        "joke": "Today a girl said she recognized me from vegetarian club, but I'm sure I've never met herbivore."
    },
    {
        "id": "ccc2933f",
        "name": "They Pinch Pennies",
        "joke": "Why do crabs never give to charity? Because they're shellfish."
    },
    {
        "id": "0790c324",
        "name": "The End Of The Joke",
        "joke": "People keep making apocalypse jokes like there's no tomorrow."
    },
    {
        "id": "72ca0902",
        "name": "Light Up Their Christmas",
        "joke": "If you're struggling to think of what to get someone for Christmas. Get them a fridge, and watch their face light up when they open it."
    },
    {
        "id": "5ce358cc",
        "name": "Czech This Joke Out",
        "joke": "I was thinking about moving to Moscow but there is no point Russian into things."
    },
    {
        "id": "13a0a567",
        "name": "They Only Serve Cheese",
        "joke": "Did you hear about the new restaurant on the moon? The food is great, but there's just no atmosphere."
    },
    {
        "id": "37f952de",
        "name": "Milking Fast",
        "joke": "Milk is also the fastest liquid on earth. It's pasteurized before you even see it."
    },
    {
        "id": "47e287a2",
        "name": "Small Thefts",
        "joke": "Did you hear that the police have a warrant out on a midget psychic ripping people off? It reads \"Small medium at large.\""
    },
    {
        "id": "45230882",
        "name": "I Take My Puns Rare",
        "joke": "A steak pun is a rare medium well done."
    },
    {
        "id": "2fdb2916",
        "name": "Clean Vocals",
        "joke": "Singing in the shower is all fun and games until you get shampoo in your mouth. Then it's a soap opera."
    },
    {
        "id": "74c77b69",
        "name": "Not Even A Tinkle",
        "joke": "Why can't you hear a pterodactyl using the bathroom? Because the P is silent."
    },
    {
        "id": "cffa76cd",
        "name": "Jump In Price",
        "joke": "The price of bouncy castles have doubled this year. That's inflation for you."
    },
    {
        "id": "1112350c",
        "name": "It's NOT Funny, Chocolate",
        "joke": "Whenever I want to start eating healthy, a chocolate bar looks at me and Snickers."
    },
    {
        "id": "cd0e2e73",
        "name": "Banana Hands",
        "joke": "What do you get hanging off banana trees? Sore arms."
    },
    {
        "id": "5037edb1",
        "name": "Perforated Hatred",
        "joke": "I hate perforated lines, they're tearable."
    },
    {
        "id": "8d9710ce",
        "name": "I Predict A Heart Attack",
        "joke": "What do you call a fat psychic? A four-chin teller."
    },
    {
        "id": "b5414a1f",
        "name": "Uno Joke, Por Favor",
        "joke": "A Mexican magician says he'll disappear on the count of 3; \"Uno... dos... poof...\". He disappeared without a tres."
    },
    {
        "id": "270b2128",
        "name": "This Joke Will Spark A Laugh",
        "joke": "What's the difference between a hippo and a Zippo? One is heavy, and the other is a little lighter."
    }
]